In [1]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
city_data_df = pd.read_csv("Resources2/city_data.csv")
city_data_df

                city  driver_count   type
0        Richardfort            38  Urban
1       Williamsstad            59  Urban
2        Port Angela            67  Urban
3         Rodneyfort            34  Urban
4        West Robert            39  Urban
..               ...           ...    ...
115     Bradshawfurt             7  Rural
116     New Ryantown             2  Rural
117   Randallchester             9  Rural
118      Jessicaport             1  Rural
119  South Saramouth             7  Rural

[120 rows x 3 columns]

In [5]:
ride_data_df = pd.read_csv("Resources2/ride_data.csv")
ride_data_df.head(10)

                 city             date   fare       ride_id
0  Lake Jonathanshire  1/14/2019 10:14  13.83  5.739410e+12
1  South Michelleport   3/4/2019 18:24  30.24  2.343910e+12
2  Port Samanthamouth   2/24/2019 4:29  33.44  2.005070e+12
3          Rodneyfort  2/10/2019 23:22  23.44  5.149250e+12
4          South Jack    3/6/2019 4:28  34.58  3.908450e+12
5        South Latoya  3/11/2019 12:26   9.52  1.995000e+12
6       New Paulville  2/27/2019 11:17  43.25  7.932080e+11
7        Simpsonburgh   4/26/2019 0:43  35.98  1.119540e+11
8     South Karenland    1/8/2019 3:28  35.09  7.995620e+12
9       North Jasmine    3/9/2019 6:26  42.81  5.327640e+12

In [12]:
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id    float64
dtype: object

In [13]:
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [14]:
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [15]:
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [16]:
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [17]:
# Get the unique values of the type of city
city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [18]:
# Get the number of data points from the Urban cities.
sum(city_data_df["type"]=="Urban")

66

In [19]:
# Get the number of data points from the Urban cities.
sum(city_data_df["type"]=="Rural")

18

In [20]:
# Get the number of data points from the Urban cities.
sum(city_data_df["type"]=="Suburban")

36

In [25]:
# Getting the number of data points from the city types by grouping (trying this way as it could be more efficient)
city_data_df_types_count = city_data_df.groupby(["type"]).count()["city"]
city_data_df_types_count

type
Rural       18
Suburban    36
Urban       66
Name: city, dtype: int64

In [29]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the DataFrame
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,1/14/2019 10:14,13.83,5739410000000.00,5,Urban
1,South Michelleport,3/4/2019 18:24,30.24,2343910000000.00,72,Urban
2,Port Samanthamouth,2/24/2019 4:29,33.44,2005070000000.00,57,Urban
3,Rodneyfort,2/10/2019 23:22,23.44,5149250000000.00,34,Urban
4,South Jack,3/6/2019 4:28,34.58,3908450000000.00,46,Urban